#include "led.h"

/**************************************************************************
LED接口初始化
**************************************************************************/
void LED_Init(void)
{
RCC->APB2ENR|=1<<2;    //使能 PORTA 时钟  
GPIOA->CRL&=0XFFF0FFFF;//清空设置
GPIOA->CRL|=0X00030000;//PA4 推挽输出
GPIOA->ODR|=1<<4;      //PA4 输出高
}

/**************************************************************************
LED闪烁
**************************************************************************/
void Led_Flash(u16 time)
{           
	  static int last_time,temp;
		   if(temp==0)last_time=time;
	     if(last_time==0)      LED=1;     //时间为0时设置灯状态为灭
       else if(last_time==1) LED=0;     //时间为1时设置灯状态为亮
	     else	if(++temp==last_time)	LED=~LED,temp=0;//其他非0和1的正整数设置灯状态为闪烁
	  
}
